import nltk
from dotenv import load_dotenv

# Загрузка переменных окружения
load_dotenv()

# Глобальные константы
RUSSIAN_WORDS_REGEX = "^[а-яА-ЯёЁ0-9]+$"
IGNORED_WORDS = ['sil']
CHANNELS = 1
SAMPLE_WIDTH = 2
FRAME_RATE = 16000

# Загрузка пакетов nltk
nltk.download('punkt')

REPLACEMENTS = {
    'Балун': 'Б+аллоун',
    'Лукаш': 'Л+укаш',
    'Палив': 'П+алив',
    'Водичк': 'В+одичк',
    'Марек': 'М+арек',
    'Горжин': 'Горж+ин',
    'Клаген': 'Кл+аген',
    'Головатенко': 'Голов+атенко',
    'Ванек': 'В+анек',
    'Голечек': 'Г+олечек',
    'Водичка': 'В+одичка',
    'Польда': 'П+ольда',
    'Подскали': 'П+одскали',
    'Водражка': 'В+одражка',
    'Вышеград': 'В+ышеград',
    'Барушко': 'Барушк+о',
    'Крамарж': 'Кр+амарж',
    'Кралуп': 'Кр+алуп',
    'Жижков': 'Ж+ижков',
    'Крамарж': 'Кр+амарж',
    'Розделов': 'Розд+елов',
    'Витуничи': 'Вит+уничи',
    'Яношек': '+Яношек',
    'Вомач': 'В+омач'
}



